app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["description", "jdkasdkh"], ["price", 123123.0], ["created_at", "2015-08-22 13:41:06.722882"], ["updated_at", "2015-08-22 13:41:06.722882"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["image_file_name", "placeholder.png"], ["image_file_size", 46414], ["image_updated_at", "2015-08-23 09:01:01.229073"], ["updated_at", "2015-08-23 09:01:01.868417"], ["id", 1]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]